cpu_affinity/fio_logs/ext4_base/randread_128k_16.log
randread: (g=0): rw=randread, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=psync, iodepth=1
...
fio-3.16
Starting 16 processes

randread: (groupid=0, jobs=16): err= 0: pid=17682: Thu Oct  9 09:18:39 2025
  read: IOPS=31.3k, BW=3916MiB/s (4106MB/s)(16.0GiB/4184msec)
    clat (usec): min=2, max=8981, avg=501.45, stdev=436.58
     lat (usec): min=2, max=8981, avg=501.48, stdev=436.58
    clat percentiles (usec):
     |  1.00th=[    9],  5.00th=[   10], 10.00th=[   12], 20.00th=[   13],
     | 30.00th=[   15], 40.00th=[  330], 50.00th=[  553], 60.00th=[  701],
     | 70.00th=[  824], 80.00th=[  922], 90.00th=[ 1045], 95.00th=[ 1139],
     | 99.00th=[ 1336], 99.50th=[ 1401], 99.90th=[ 1582], 99.95th=[ 1663],
     | 99.99th=[ 7898]
   bw (  MiB/s): min= 2541, max= 5707, per=97.91%, avg=3833.97, stdev=64.75, samples=128
   iops        : min=20328, max=45658, avg=30671.75, stdev=518.02, samples=128
  lat (usec)   : 4=0.01%, 10=5.10%, 20=31.29%, 50=0.35%, 100=0.01%
  lat (usec)   : 250=1.10%, 500=9.57%, 750=16.31%, 1000=22.87%
  lat (msec)   : 2=13.40%, 10=0.01%
  cpu          : usr=0.12%, sys=4.59%, ctx=83082, majf=0, minf=677
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=131072,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=3916MiB/s (4106MB/s), 3916MiB/s-3916MiB/s (4106MB/s-4106MB/s), io=16.0GiB (17.2GB), run=4184-4184msec

Disk stats (read/write):
  nvme1n1: ios=82457/0, merge=0/0, ticks=62705/0, in_queue=62705, util=97.76%