cpu_affinity/fio_logs/ext4_base/randread_4k_8.log
randread: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.16
Starting 8 processes

randread: (groupid=0, jobs=8): err= 0: pid=12244: Thu Oct  9 09:17:13 2025
  read: IOPS=171k, BW=667MiB/s (700MB/s)(8192MiB/12274msec)
    clat (nsec): min=197, max=1777.5k, avg=45269.83, stdev=38075.30
     lat (nsec): min=211, max=1777.6k, avg=45299.00, stdev=38076.93
    clat percentiles (nsec):
     |  1.00th=[   556],  5.00th=[   644], 10.00th=[   732], 20.00th=[   916],
     | 30.00th=[  1160], 40.00th=[ 46848], 50.00th=[ 55040], 60.00th=[ 62208],
     | 70.00th=[ 66048], 80.00th=[ 75264], 90.00th=[ 87552], 95.00th=[103936],
     | 99.00th=[136192], 99.50th=[148480], 99.90th=[181248], 99.95th=[195584],
     | 99.99th=[230400]
   bw (  KiB/s): min=452024, max=1147320, per=100.00%, avg=696361.10, stdev=24623.76, samples=188
   iops        : min=113006, max=286830, avg=174090.28, stdev=6155.94, samples=188
  lat (nsec)   : 250=0.01%, 500=0.16%, 750=10.98%, 1000=12.90%
  lat (usec)   : 2=11.59%, 4=1.09%, 10=0.03%, 20=0.01%, 50=9.25%
  lat (usec)   : 100=47.88%, 250=6.12%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=1.08%, sys=6.29%, ctx=1326882, majf=0, minf=89
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2097152,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=667MiB/s (700MB/s), 667MiB/s-667MiB/s (700MB/s-700MB/s), io=8192MiB (8590MB), run=12274-12274msec

Disk stats (read/write):
  nvme1n1: ios=1322601/3, merge=0/1, ticks=89264/8, in_queue=89274, util=99.24%