cpu_affinity/fio_logs/ext4_base/randwrite_128k_4.log
randwrite: (g=0): rw=randwrite, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=psync, iodepth=1
...
fio-3.16
Starting 4 processes

randwrite: (groupid=0, jobs=4): err= 0: pid=25534: Thu Oct  9 09:21:54 2025
  write: IOPS=25.4k, BW=3175MiB/s (3329MB/s)(4096MiB/1290msec); 0 zone resets
    clat (usec): min=5, max=223, avg=28.75, stdev=10.46
     lat (usec): min=5, max=227, avg=29.21, stdev=10.56
    clat percentiles (usec):
     |  1.00th=[   16],  5.00th=[   18], 10.00th=[   19], 20.00th=[   20],
     | 30.00th=[   22], 40.00th=[   30], 50.00th=[   32], 60.00th=[   33],
     | 70.00th=[   34], 80.00th=[   35], 90.00th=[   36], 95.00th=[   37],
     | 99.00th=[   59], 99.50th=[   69], 99.90th=[  137], 99.95th=[  139],
     | 99.99th=[  196]
  lat (usec)   : 10=0.09%, 20=22.40%, 50=76.27%, 100=0.78%, 250=0.46%
  cpu          : usr=0.31%, sys=29.75%, ctx=1114, majf=0, minf=36
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,32768,0,4 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=3175MiB/s (3329MB/s), 3175MiB/s-3175MiB/s (3329MB/s-3329MB/s), io=4096MiB (4295MB), run=1290-1290msec

Disk stats (read/write):
  nvme1n1: ios=0/7883, merge=0/0, ticks=0/150253, in_queue=150253, util=72.99%