cpu_affinity/fio_logs/ext4_base/randwrite_4k_16.log
randwrite: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.16
Starting 16 processes

randwrite: (groupid=0, jobs=16): err= 0: pid=21001: Thu Oct  9 09:20:41 2025
  write: IOPS=219k, BW=857MiB/s (898MB/s)(16.0GiB/19127msec); 0 zone resets
    clat (nsec): min=252, max=54884k, avg=25737.33, stdev=951489.63
     lat (nsec): min=272, max=54884k, avg=25764.03, stdev=951489.58
    clat percentiles (nsec):
     |  1.00th=[     676],  5.00th=[     764], 10.00th=[     844],
     | 20.00th=[     964], 30.00th=[    1080], 40.00th=[    1304],
     | 50.00th=[    1672], 60.00th=[    2008], 70.00th=[    2352],
     | 80.00th=[    2736], 90.00th=[    3504], 95.00th=[    4256],
     | 99.00th=[    5984], 99.50th=[    7392], 99.90th=[   16320],
     | 99.95th=[33816576], 99.99th=[45875200]
   bw (  MiB/s): min= 1348, max=12145, per=100.00%, avg=2693.83, stdev=180.77, samples=206
   iops        : min=345226, max=3109180, avg=689621.49, stdev=46275.88, samples=206
  lat (nsec)   : 500=0.04%, 750=4.12%, 1000=19.36%
  lat (usec)   : 2=36.03%, 4=33.94%, 10=6.29%, 20=0.13%, 50=0.02%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 50=0.06%, 100=0.01%
  cpu          : usr=0.32%, sys=4.49%, ctx=504507, majf=0, minf=195
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,4194304,0,16 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=857MiB/s (898MB/s), 857MiB/s-857MiB/s (898MB/s-898MB/s), io=16.0GiB (17.2GB), run=19127-19127msec

Disk stats (read/write):
  nvme1n1: ios=8/1441621, merge=0/6, ticks=6/5175544, in_queue=5175872, util=98.59%